RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32E50x_Firmware_Library/GD32E50x_standard_peripheral/Source/gd32e50x_shrtimer.c
    switch(timer_id)
    {
        /* get the Master_TIMER interrupt flag */
        case SHRTIMER_MASTER_TIMER:
            interflag = (SHRTIMER_MTINTF(shrtimer_periph) & interrupt);
            interen = (SHRTIMER_MTDMAINTEN(shrtimer_periph) & interrupt);
            if((RESET != interflag) && (RESET != interen))
            {
                flag = SET;
            }else{
                flag =  RESET;
            }
        break;
        /* get the Slave_TIMER interrupt flag */
        case SHRTIMER_SLAVE_TIMER0:
        case SHRTIMER_SLAVE_TIMER1:
        case SHRTIMER_SLAVE_TIMER2:
        case SHRTIMER_SLAVE_TIMER3:
        case SHRTIMER_SLAVE_TIMER4:
            interflag = (SHRTIMER_STXINTF(shrtimer_periph, timer_id) & interrupt);
            interen = (SHRTIMER_STXDMAINTEN(shrtimer_periph, timer_id) & interrupt);
            if((RESET != interflag) && (RESET != interen))
            {
                flag =  SET;
            }else{
                flag =  RESET;
            }
        break;

        default:
        break;
    }
    return flag;
}

/*!
    \brief      clear the Master_TIMER and Slave_TIMER interrupt flag
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  timer_id: SHRTIMER_MASTER_TIMER, SHRTIMER_SLAVE_TIMERx(x=0..4)
    \param[in]  interrupt: interrupt source
                only one parameter can be selected which is shown as below:
      \arg         SHRTIMER_MT_ST_INT_FLAG_CMP0: compare 0 interrupt flag, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_MT_ST_INT_FLAG_CMP1: compare 1 interrupt flag, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_MT_ST_INT_FLAG_CMP2: compare 2 interrupt flag, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_MT_ST_INT_FLAG_CMP3: compare 3 interrupt flag, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_MT_ST_INT_FLAG_REP: repetition interrupt flag, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_MT_INT_FLAG_SYNI: synchronization input interrupt flag, for Master_TIMER
      \arg         SHRTIMER_MT_ST_INT_FLAG_UPD: update interrupt flag, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_ST_INT_FLAG_CAP0: capture 0 interrupt flag, for Slave_TIMER
      \arg         SHRTIMER_ST_INT_FLAG_CAP1: capture 1 interrupt flag, for Slave_TIMER
      \arg         SHRTIMER_ST_INT_FLAG_CH0OA: channel 0 output active interrupt flag, for Slave_TIMER
      \arg         SHRTIMER_ST_INT_FLAG_CH0ONA: channel 0 output inactive interrupt flag, for Slave_TIMER
      \arg         SHRTIMER_ST_INT_FLAG_CH1OA: channel 1 output active interrupt flag, for Slave_TIMER
      \arg         SHRTIMER_ST_INT_FLAG_CH1ONA: channel 1 output inactive interrupt flag, for Slave_TIMER
      \arg         SHRTIMER_ST_INT_FLAG_CNTRST: counter reset interrupt flag, for Slave_TIMER
      \arg         SHRTIMER_ST_INT_FLAG_DLYIDLE: delayed IDLE mode entry interrupt flag, for Slave_TIMER
    \param[out] none
    \retval     none
*/
void shrtimer_timers_interrupt_flag_clear(uint32_t shrtimer_periph, uint32_t timer_id, uint32_t interrupt)
{
    switch(timer_id)
    {
        /* clear the Master_TIMER interrupt flag */
        case SHRTIMER_MASTER_TIMER:
            SHRTIMER_MTINTC(shrtimer_periph) |= interrupt;
        break;
        /* clear theSlave_TIMER interrupt flag */
        case SHRTIMER_SLAVE_TIMER0:
        case SHRTIMER_SLAVE_TIMER1:
        case SHRTIMER_SLAVE_TIMER2:
        case SHRTIMER_SLAVE_TIMER3:
        case SHRTIMER_SLAVE_TIMER4:
            SHRTIMER_STXINTC(shrtimer_periph, timer_id) |= interrupt;
        break;

        default:
        break;
    }
}

/*!
    \brief      enable SHRTIMER common interrupt
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  interrupt: interrupt source
                only one parameter can be selected which is shown as below:
      \arg         SHRTIMER_INT_SYSFLT: system fault interrupt
      \arg         SHRTIMER_INT_DLLCAL: DLL calibration completed interrupt
      \arg         SHRTIMER_INT_BMPER: bunch mode period interrupt
    \param[out] none
    \retval     none
*/
void shrtimer_common_interrupt_enable(uint32_t shrtimer_periph, uint32_t interrupt)
{
    SHRTIMER_INTEN(shrtimer_periph) |= interrupt;
}

/*!
    \brief      disable SHRTIMER common interrupt
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  interrupt: interrupt source
                only one parameter can be selected which is shown as below:
      \arg         SHRTIMER_INT_FLT0: fault 0 interrupt
      \arg         SHRTIMER_INT_FLT1: fault 1 interrupt
      \arg         SHRTIMER_INT_FLT2: fault 2 interrupt
      \arg         SHRTIMER_INT_FLT3: fault 3 interrupt
      \arg         SHRTIMER_INT_FLT4: fault 4 interrupt
      \arg         SHRTIMER_INT_SYSFLT: system fault interrupt
      \arg         SHRTIMER_INT_DLLCAL: DLL calibration completed interrupt
      \arg         SHRTIMER_INT_BMPER: bunch mode period interrupt
    \param[out] none
    \retval     none
*/
void shrtimer_common_interrupt_disable(uint32_t shrtimer_periph, uint32_t interrupt)
{
    SHRTIMER_INTEN(shrtimer_periph) &= ~interrupt;
}

/*!
    \brief      get the common interrupt flag
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  interrupt: interrupt source
                only one parameter can be selected which is shown as below:
      \arg         SHRTIMER_INT_FLAG_FLT0: fault 0 interrupt flag
      \arg         SHRTIMER_INT_FLAG_FLT1: fault 1 interrupt flag
      \arg         SHRTIMER_INT_FLAG_FLT2: fault 2 interrupt flag
      \arg         SHRTIMER_INT_FLAG_FLT3: fault 3 interrupt flag
      \arg         SHRTIMER_INT_FLAG_FLT4: fault 4 interrupt flag
      \arg         SHRTIMER_INT_FLAG_SYSFLT: system fault interrupt flag
      \arg         SHRTIMER_INT_FLAG_DLLCAL: DLL calibration completed interrupt flag
      \arg         SHRTIMER_INT_FLAG_BMPER: bunch mode period interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus shrtimer_common_interrupt_flag_get(uint32_t shrtimer_periph, uint32_t interrupt)
{
    uint32_t interflag = 0U;
    uint32_t interen = 0U;

    /* get the interrupt correlation bit value */
    interflag = (SHRTIMER_INTF(shrtimer_periph) & interrupt);
    interen = (SHRTIMER_INTEN(shrtimer_periph) & interrupt);

    /* get the interrupt flag */
    if((RESET != interflag) && (RESET != interen))
    {
        return SET;
    }else{
        return RESET;
    }
}

/*!
    \brief      clear the common interrupt flag
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  interrupt: interrupt source
                only one parameter can be selected which is shown as below:
      \arg         SHRTIMER_INT_FLAG_FLT0: fault 0 interrupt flag
      \arg         SHRTIMER_INT_FLAG_FLT1: fault 1 interrupt flag
      \arg         SHRTIMER_INT_FLAG_FLT2: fault 2 interrupt flag
      \arg         SHRTIMER_INT_FLAG_FLT3: fault 3 interrupt flag
      \arg         SHRTIMER_INT_FLAG_FLT4: fault 4 interrupt flag
      \arg         SHRTIMER_INT_FLAG_SYSFLT: system fault interrupt flag
      \arg         SHRTIMER_INT_FLAG_DLLCAL: DLL calibration completed interrupt flag
      \arg         SHRTIMER_INT_FLAG_BMPER: bunch mode period interrupt flag
    \param[out] none
    \retval     none
*/
void shrtimer_common_interrupt_flag_clear(uint32_t shrtimer_periph, uint32_t interrupt)
{
    SHRTIMER_INTC(shrtimer_periph) |= interrupt;
}

/*!
    \brief      configure Master_TIMER timer base
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  master_baseinit: SHRTIMER time base parameters struct
                  period: period value, min value: 3*tSHRTIMER_CK clock, max value: 0xFFFF �C (1*tSHRTIMER_CK)
                  repetitioncounter: the counter repetition value, 0x00~0xFF
                  prescaler: SHRTIMER_PRESCALER_MULy(y=64,32,16,8,4,2),SHRTIMER_PRESCALER_DIVy(y=1,2,4)
                  counter_mode: SHRTIMER_COUNTER_MODE_CONTINOUS, SHRTIMER_COUNTER_MODE_SINGLEPULSE, SHRTIMER_COUNTER_MODE_SINGLEPULSE_RETRIGGERABLE
    \param[out] none
    \retval     none
*/
static void master_timer_base_config(uint32_t shrtimer_periph, shrtimer_baseinit_parameter_struct* master_baseinit)
{
    /* set counter clock division */
    SHRTIMER_MTCTL0(shrtimer_periph) &= (uint32_t) ~(SHRTIMER_MTCTL0_CNTCKDIV2_0);
    SHRTIMER_MTACTL(shrtimer_periph) &= (uint32_t) ~(SHRTIMER_MTACTL_CNTCKDIV3);
    SHRTIMER_MTCTL0(shrtimer_periph) |= (uint32_t)((master_baseinit->prescaler) & CNTCKDIV2_0_MASK);
    SHRTIMER_MTACTL(shrtimer_periph) |= (uint32_t)((master_baseinit->prescaler) & CNTCKDIV3_MASK);

